#
# .zplugins.txt - antidote plugins file
#

#
# Init
#

mattmc3/zephyr path:plugins/environment
huadeity/zsh-proxy
mattmc3/zephyr path:plugins/homebrew conditional:is-macos
mattmc3/zephyr path:plugins/zfunctions
mattmc3/zephyr path:plugins/confd
# zsh-hooks/zsh-hooks

#
# Completions
#

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

#
# Prompts
#

mattmc3/zephyr path:plugins/prompt
romkatv/powerlevel10k kind:fpath

#
# Custom
#

#
# Utils
#

mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/utility
romkatv/zsh-bench kind:path
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/extract
mattmc3/zman

#
# Editor
#

mattmc3/zephyr path:plugins/editor
romkatv/zsh-no-ps2

#
# macOS
#

mattmc3/zephyr path:plugins/macos conditional:is-macos

#
# Tools
#
zimfw/git conditional:"is-callable git"
zimfw/exa conditional:"is-callable eza || is-callable exa"
zimfw/fzf conditional:"is-callable fzf"

#
# Fish-like
#

zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions post:post-autosuggestions
# zsh-users/zsh-history-substring-search post:post-history-substring-search

# vi: ft=properties
