#
# .zplugins.txt - antidote plugins file
#

#
# Init
#

mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

huadeity/zsh-proxy

mattmc3/zephyr path:plugins/zfunctions post:set_flavor

zsh-users/zsh-syntax-highlighting

zsh-users/zsh-autosuggestions

# zsh-users/zsh-history-substring-search

olets/zsh-abbr
olets/zsh-autosuggestions-abbreviations-strategy

mattmc3/zephyr path:plugins/homebrew

mattmc3/zephyr path:plugins/confd
# zsh-hooks/zsh-hooks

romkatv/powerlevel10k kind:fpath

romkatv/zsh-bench kind:path
zimfw/archive

wazum/zsh-directory-dot-expansion
zshzoo/magic-enter
xPMo/zsh-toggle-command-prefix
romkatv/zsh-no-ps2

mattmc3/zephyr path:plugins/macos conditional:is-macos

#
# Tools
#

zimfw/direnv
zimfw/fzf

# vi: ft=properties
