huadeity/zsh-proxy
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
olets/zsh-abbr
olets/zsh-autosuggestions-abbreviations-strategy
# zsh-hooks/zsh-hooks
romkatv/powerlevel10k
romkatv/zsh-bench kind:path
romkatv/zsh-no-ps2
wazum/zsh-directory-dot-expansion
zshzoo/magic-enter
xPMo/zsh-toggle-command-prefix
zimfw/archive
zimfw/direnv
zimfw/fzf

# vi: ft=properties
