jorgebucaran/fisher
PatrickF1/fzf.fish
mattmc3/homebrew.fish
catppuccin/fish
mattmc3/magic-enter.fish
mattmc3/macos.fish
jorgebucaran/hydro
mattmc3/macos.fish
zzhaolei/transient.fish
jorgebucaran/replay.fish
