jorgebucaran/fisher
mattmc3/homebrew.fish
catppuccin/fish
jorgebucaran/hydro
zzhaolei/transient.fish
shoriminimoe/fish-extract
nickeb96/puffer-fish
mattmc3/magic-enter.fish
mattmc3/macos.fish
jorgebucaran/autopair.fish
jorgebucaran/fishtape
jorgebucaran/getopts.fish
jorgebucaran/replay.fish
